In [23]:
# Import Dependencies
import matplotlib.pyplot as plt
import pandas as pd

In [28]:
# Import our data into pandas from CSV
s_p_500 = 'SP500.csv'
s_p_500_df = pd.read_csv(s_p_500, low_memory=False)

In [50]:
s_p_500_df.head()

        DATE    SP500    month
0 2018-10-29  2641.25  2018-10
1 2018-10-30  2682.63  2018-10
2 2018-10-31  2711.74  2018-10
3 2018-11-01  2740.37  2018-11
4 2018-11-02  2723.06  2018-11

In [75]:
# Convert Date to date format. Lots of help
s_p_500_df['SP500'] = pd.to_numeric(s_p_500_df['SP500'])
s_p_500_df = s_p_500_df.dropna(subset=['SP500'])

s_p_500_df["DATE"] = pd.to_datetime(s_p_500_df["DATE"], format='%m/%d/%Y')
s_p_500_df.head()

        DATE    SP500    month
0 2018-10-29  2641.25  2018-10
1 2018-10-30  2682.63  2018-10
2 2018-10-31  2711.74  2018-10
3 2018-11-01  2740.37  2018-11
4 2018-11-02  2723.06  2018-11

In [76]:
s_p_500_df["month"] = s_p_500_df["DATE"].dt.to_period("M")
s_p_500_df["month"] = s_p_500_df["month"].dt.strftime('%m/%Y')
s_p_500_df.head()

        DATE    SP500    month
0 2018-10-29  2641.25  10/2018
1 2018-10-30  2682.63  10/2018
2 2018-10-31  2711.74  10/2018
3 2018-11-01  2740.37  11/2018
4 2018-11-02  2723.06  11/2018

In [80]:
sp500_month_summary = s_p_500_df.groupby('month').agg(SP500=('SP500', 'mean'))
sp500_month_summary

               SP500
month
01/2019  2607.390000
01/2020  3278.202857
01/2021  3793.748421
01/2022  4573.815500
01/2023  3960.656500
...              ...
12/2018  2567.307368
12/2019  3176.749524
12/2020  3695.310000
12/2021  4674.772727
12/2022  3912.380952

[61 rows x 1 columns]

In [79]:
len(sp500_month_summary)

61

In [88]:
# Import our data into pandas from CSV
tbill_int_rate = 'TB3MS.csv'
tbill_int_rate_df = pd.read_csv(tbill_int_rate, low_memory=False)

tbill_int_rate_df["month"] = pd.to_datetime(tbill_int_rate_df["DATE"], format='%m/%d/%Y')
tbill_int_rate_df["month"] = tbill_int_rate_df["month"].dt.to_period("M")
tbill_int_rate_df["month"] = tbill_int_rate_df["month"].dt.strftime('%m/%Y')


tbill_int_rate_df.head()

       DATE  TB3MS    month
0  1/1/1934   0.72  01/1934
1  2/1/1934   0.62  02/1934
2  3/1/1934   0.24  03/1934
3  4/1/1934   0.15  04/1934
4  5/1/1934   0.16  05/1934

In [89]:
# Combine the data into a single DataFrame
tbill_and_sp500 = pd.merge(tbill_int_rate_df, sp500_month_summary, how="left", on=["month", "month"])
tbill_and_sp500.head()

       DATE  TB3MS    month  SP500
0  1/1/1934   0.72  01/1934    NaN
1  2/1/1934   0.62  02/1934    NaN
2  3/1/1934   0.24  03/1934    NaN
3  4/1/1934   0.15  04/1934    NaN
4  5/1/1934   0.16  05/1934    NaN

In [90]:

tbill_and_sp500_overlap = tbill_and_sp500.dropna(subset=['SP500', 'TB3MS'])
tbill_and_sp500_overlap.head()

           DATE  TB3MS    month        SP500
1017  10/1/2018   2.25  10/2018  2678.540000
1018  11/1/2018   2.33  11/2018  2723.229524
1019  12/1/2018   2.37  12/2018  2567.307368
1020   1/1/2019   2.37  01/2019  2607.390000
1021   2/1/2019   2.39  02/2019  2754.864211